released/MS51_RGBLED_GPIO/Sample_Code/Template/Project/main.c
};
//#endif 

void delay(uint16_t dly)
{
/*
	delay(100) : 68.19 us
	delay(200) : 134 us
	delay(300) : 220 us
	delay(400) : 287 us	
	delay(400) : 287 us	
	delay(450) : 321 us		
	delay(500) : 354 us	
	
	delay(1500) : 1ms	
*/


	while( dly--);
}

void delay_ms(uint16_t ms)
{
	uint16_t i = 0 ;
	for (i=0;i<ms;i++)
	{
		delay(MS_1MS);
	}
}


UINT8 read_APROM_BYTE(UINT16 code *u16_addr)
{
  UINT8 rdata;
  rdata = *u16_addr>>8;
  return rdata;
}

void write_DATAFLASH_BYTE(UINT16 u16_addr,UINT8 u8_data)
{
	UINT8 looptmp=0;
	UINT16 u16_addrl_r;

	UINT16 tmp=0;
	//Check page start address
	u16_addrl_r=(u16_addr/128)*128;
	//Save APROM data to XRAM0
	for(looptmp=0;looptmp<0x80;looptmp++)
	{
		tmp = read_APROM_BYTE((unsigned int code *)(u16_addrl_r+looptmp));
		page_buffer[looptmp]=tmp;
	}
	// Modify customer data in XRAM
	page_buffer[u16_addr&0x7f] = u8_data;

	//Erase APROM DATAFLASH page
	IAPAL = u16_addrl_r&0xff;
	IAPAH = (u16_addrl_r>>8)&0xff;
	IAPFD = 0xFF;
	set_CHPCON_IAPEN; 
	set_IAPUEN_APUEN;
	IAPCN = 0x22;     
	set_IAPTRG_IAPGO; 

	//Save changed RAM data to APROM DATAFLASH

	set_CHPCON_IAPEN; 
	set_IAPUEN_APUEN;
	IAPCN = 0x21;
	for(looptmp=0;looptmp<0x80;looptmp++)
	{
		IAPAL = (u16_addrl_r&0xff)+looptmp;
		IAPAH = (u16_addrl_r>>8)&0xff;
		IAPFD = page_buffer[looptmp];
		set_IAPTRG_IAPGO;      
	}
	clr_IAPUEN_APUEN;
	clr_CHPCON_IAPEN;
}  

void GPIO_WS2812C_DATA1(void)
{	
	// high : 900ns , low : 300ns
	#if defined (ENABLE_BIT_900_300)	

//P13 = 1;
	
	set_LEDGPIO(1);

	nop;nop;nop;nop;
	nop;nop;nop;nop;
	nop;nop;nop;nop;
	nop;nop;nop;nop;
	nop;nop;
	
	set_LEDGPIO(0);

	nop;nop;nop;nop;	

//P13 = 0;

	// high : 375*2 , low : 375
	#elif defined (ENABLE_BIT_750_375)	

	set_LEDGPIO(1);
	nop;nop;nop;nop;nop;
	set_LEDGPIO(1);
	nop;nop;nop;nop;nop;
	
	set_LEDGPIO(0);
	nop;nop;nop;nop;nop;
	#endif
}

void GPIO_WS2812C_DATA0(void)
{
	// high : 300ns , low : 900ns
	#if defined (ENABLE_BIT_900_300)		
		
//P14 = 1;
	
	set_LEDGPIO(1);

	nop;nop;nop;nop;

	set_LEDGPIO(0);

	nop;nop;nop;nop;
	nop;nop;nop;nop;
	nop;nop;nop;nop;
	nop;nop;nop;nop;
	nop;nop;

//P14 = 0;

	// high : 375 , low : 375*2
	#elif defined (ENABLE_BIT_750_375)
	
	set_LEDGPIO(1);
	nop;nop;nop;nop;nop;
			
	set_LEDGPIO(0);
	nop;nop;nop;nop;nop;

	
	set_LEDGPIO(0);
	nop;nop;nop;nop;nop;
	#endif
}

void GPIO_WS2812C_Send_1Byte(uint8_t Data)
{
	uint8_t i = 0;

	for (i = 0; i < 8; i ++)
	{
		if (Data & 0x80)
		{
			GPIO_WS2812C_DATA1();
		}
		else
		{
			GPIO_WS2812C_DATA0();
		}
		Data <<= 1;	
	} 	
}


void GPIO_WS2812C_Send_1bit(uint8_t Data)
{
	
	switch(Data)	//	nop; 225ns
	{
		case 0: 
			GPIO_WS2812C_DATA0();				
			break;
		default:
			GPIO_WS2812C_DATA1();
			break;
	}

}

void GPIO_WS2812C_Initial(void)
{     
	#if defined (USE_P00)
//	set_P0SR_0;	//PnSR ¡V Port n Slew Rate  : set P0.n high-speed output slew rate.	
	P00_PUSHPULL_MODE;														// P00 (MOSI) Quasi mode	

	#elif defined (USE_P01)
//	set_P0SR_1;	//PnSR ¡V Port n Slew Rate  : set P0.n high-speed output slew rate.	
	P01_PUSHPULL_MODE;	

	#elif defined (USE_P12)
//	set_P1SR_2;	//PnSR ¡V Port n Slew Rate  : set P0.n high-speed output slew rate.		
	P12_PUSHPULL_MODE;	

	#endif
}

/*
	DATA COLLECT CPU : 
	18 LED : 3.468 ms
	17 LED : 3.287 ms
	10 LED : 1.947 ms	, latch : 602
	5 LED : 0.965 ms	, latch : 324
	4 LED : 0.784 ms	, latch : 254	
	3 LED : 0.591 ms	, latch : 192
	2 LED : 0.401 ms	, latch : 134	
	1 LED : 0.210 ms	, latch : 79		
*/

void setLED_ResetPulse(uint8_t pos)	//target : 280us
{
	uint16_t i = 0 ;

	set_LEDGPIO(0);
	
	if (pos == WS_RES_POS_FRONT)	//57 us
	{
		delay(100);
	}
	else
	{
		delay(MS_LED_LATCH);
	}

}

void setLED_Display(uint16_t DataCount)
{
	uint16_t Count = DataCount;
	uint8_t i = 0;
	
	setLED_ResetPulse(WS_RES_POS_FRONT);

	clr_EA;
	for(i=0;i<(LED_NUM);i++)
	{
		GPIO_WS2812C_Send_1Byte(DataBuffer[i*3]);
		GPIO_WS2812C_Send_1Byte(DataBuffer[i*3+1]);
		GPIO_WS2812C_Send_1Byte(DataBuffer[i*3+2]);		
	}
	set_EA;
	
	setLED_ResetPulse(WS_RES_POS_BACK);
}

void setLED_BufferClear(void)
{
	memset(DataBuffer,0x00,LED_DATA_LEN);
}

void setLED_Color(uint8_t DeviceNumber ,uint8_t RED, uint8_t GREEN, uint8_t BLUE)	// Output a colour Format: GGRRBB	
{
	uint16_t index = 0;	
	uint8_t i = 0;

	DataBuffer[DeviceNumber*3]   = GREEN;
	DataBuffer[DeviceNumber*3+1] = RED;
	DataBuffer[DeviceNumber*3+2] = BLUE;
}

void setLED_ColorWipe(uint8_t RED, uint8_t GREEN, uint8_t BLUE) 
{
	uint8_t index = 0 ;

	for (index = 0; index < LED_NUM; index++)
	{
		setLED_Color(index, RED, GREEN, BLUE);
	}

	setLED_Display(LED_DATA_LEN);
}

//https://github.com/fduignan/NucleoF042_SingleWS2812B/blob/master/main.c
void _stripEffect_Rainbow(uint8_t* RED, uint8_t* GREEN, uint8_t* BLUE)	
{   
	// Cycle through the colours of the rainbow (non-uniform brightness however)
	// Inspired by : http://academe.co.uk/2012/04/arduino-cycling-through-colours-of-the-rainbow/
	
	static uint8_t Red = 255;
	static uint8_t Green = 0;
	static uint8_t Blue = 0;
	static uint8_t State = 0;
	switch (State)
	{
		case 0:{
			Green++;
			if (Green == 255)
				State = 1;
			break;
		}
		case 1:{
			Red--;
			if (Red == 0)
				State = 2;
			break;
		}
		case 2:{
			Blue++;
			if (Blue == 255)
				State = 3;			
			break;
		}
		case 3:{
			Green--;
			if (Green == 0)
				State = 4;
			break;
		}
		case 4:{
			Red++;
			if (Red == 255)
				State = 5;
			break;
		}
		case 5:{
			Blue --;
			if (Blue == 0)
				State = 0;
			break;
		}		
	}

	*GREEN = Green;
	*RED = Red;
	*BLUE = Blue;	
//	return (Green << 16) + (Red << 8) + Blue;


}

uint8_t _stripEffect_Wheel(uint8_t WheelPos , uint8_t* RED, uint8_t* GREEN, uint8_t* BLUE) 
{
	WheelPos = 255 - WheelPos;
	if(WheelPos < 85) 
	{
		*GREEN = 0;
		*RED = 255 - WheelPos * 3;
		*BLUE = WheelPos * 3;
		return 0;
		
//		return PACK_RGB(255 - WheelPos * 3, 0, WheelPos * 3);
	}
	if(WheelPos < 170) 
	{
		WheelPos -= 85;

		*GREEN = WheelPos * 3;
		*RED = 0;
		*BLUE = 255 - WheelPos * 3;
		return 0;
		
//		return PACK_RGB(0, WheelPos * 3, 255 - WheelPos * 3);
	}
	
	WheelPos -= 170;

