released/MS51_RGBLED_GPIO/Sample_Code/Template/Project/main.c
			delay_ms(time);

			for (i=0; i < LED_NUM ; i=i+3) 
			{
				setLED_Color(i+q, 0 , 0 , 0);        //turn every third pixel off
			}
		}
	}
}

void getTheaterChase(uint16_t time ,uint8_t RED, uint8_t GREEN, uint8_t BLUE) 
{
	uint16_t j = 0;
	uint16_t q = 0;
	uint16_t i = 0;

	for (j=0; j<10; j++) 
	{  //do 10 cycles of chasing
		for (q=0; q < 3; q++) 
		{
			for (i=0; i < LED_NUM; i=i+3) 
			{
				setLED_Color(i+q, RED,GREEN,BLUE);    //turn every third pixel on
			}
			setLED_Display(LED_DATA_LEN);

			delay_ms(time);

			for (i=0; i < LED_NUM; i=i+3) 
			{
				setLED_Color(i+q, 0 , 0 , 0);        //turn every third pixel off
			}
		}
	}
}


void getRainbowCycle(uint8_t cycle , uint16_t time) 
{
	uint16_t i = 0, j = 0;
	uint8_t red , green, blue = 0;
	
	for(j=0; j<256*cycle; j++) 
	{ 
		// 5 cycles of all colors on wheel
		for(i=0; i< LED_NUM; i++) 
		{
			_stripEffect_Wheel((((i * 256 / LED_NUM) + j) & 255),&red,&green,&blue);
			setLED_Color(i,red,green,blue);
		
//			setLED_Color(i, 
//				UNPACK_R(_stripEffect_Wheel(((i * 256 / LED_NUM) + j) & 255)),
//				UNPACK_G(_stripEffect_Wheel(((i * 256 / LED_NUM) + j) & 255)),
//				UNPACK_B(_stripEffect_Wheel(((i * 256 / LED_NUM) + j) & 255)));
		}
		
		setLED_Display(LED_DATA_LEN);

		delay_ms(time);
	}
}

void getRainbow(uint16_t time)
{
	uint8_t i = 0;
	uint8_t red , green, blue = 0;

	for (i=0;i<LED_NUM;i++)
	{
		_stripEffect_Rainbow(&red,&green,&blue);
		setLED_Color(i,red,green,blue); // Output a colour Format: GGRRBB							
	}
	
	// Now send out the bits to the SPI bus
	setLED_Display(LED_DATA_LEN);  	

	delay_ms(time);	
}

void getBreathing(uint16_t time)
{
	uint8_t i = 0;
	uint16_t j = 0;
	static uint8_t flag = 1;
	uint8_t led = 0;
	uint16_t index = 0 ;
	uint8_t red,green,blue = 0;

	red = colorsFull[index][0];
	green = colorsFull[index][1];
	blue = colorsFull[index][2];
	
	if (flag)
	{
		for (led = 0; led < LED_NUM; led++)
		{
			setLED_Color(led,red,green,blue);			
		}
		setLED_Display(LED_DATA_LEN);
		delay_ms(time);	
		flag = 0;
	}
	else
	{
		for (j=0xFF;j>0x7F;j--)
		{
			setLED_ColorWipe(j,j,j);
			delay_ms(time);
		}
		flag = 1;
	}

	if ((index++) > COLORTALBE_NUM)
	{
		index = 0;
	}
	
}

void ColorIndexChange(void)
{
	static uint8_t flag = 1;

	//if oever colorsFull table index 766
	Coloridx = MAKEWORD(read_APROM_BYTE(DATA_FLASH_COLOR_IDX_MSB),read_APROM_BYTE(DATA_FLASH_COLOR_IDX_LSB));

	if (flag)		//reverse color index
	{
		if ( Coloridx >= (COLORTALBE_NUM-1))
		{
			flag = 0;
			Coloridx = COLORTALBE_NUM-1;
		}
		else
		{
			Coloridx++;
		}
	}
	else
	{
		if (Coloridx <= 0)
		{
			flag = 1;
			Coloridx = 0;	
		}
		else
		{
			Coloridx--;
		}
	}

	write_DATAFLASH_BYTE(DATA_FLASH_COLOR_IDX_MSB,(uint8_t) HIBYTE(Coloridx));
	write_DATAFLASH_BYTE(DATA_FLASH_COLOR_IDX_LSB, (uint8_t) LOBYTE(Coloridx));	
	
}


void DemoStateChange(void)
{
	DemoState = read_APROM_BYTE(DATA_FLASH_PATTERN_IDX);
	if (DemoState++ >= (state_Max-1))
	{
		DemoState = state_Rainbow;
	}

	write_DATAFLASH_BYTE(DATA_FLASH_PATTERN_IDX,DemoState);
	
	//reset MCU ?
//	set_CHPCON_SWRST;	
}


void SimpleTest(void)
{
//	uint16_t i = 0;
//	static uint8_t flag = 1;
//	if (flag)
//	{
//		for (i = 0x00 ;i < 0xFF; i++)
//		{
//			setLED_ColorWipe(i,i,i);
//			delay_ms(60);
//		}
//		flag = 0;
//	}
//	else
//	{
//		for (i = 0xFF ;i > 0x00; i--)
//		{
//			setLED_ColorWipe(i,i,i);
//			delay_ms(60);
//		}		
//		flag = 1;
//	}

//	PWMx_CHx_SetDuty(WS_PWM_HIGH);
//	delay_ms(50);

//	PWMx_CHx_SetDuty(WS_PWM_LOW);
//	delay_ms(50);

//	setLED_BufferClear();
//	setLED_ColorWipe(0xFF, 0x00, 0x00);
//	setLED_Color(0, 0xFF, 0x00, 0x00);
//	setLED_Display(LED_DATA_LEN);
//	delay_ms(300);

//	setLED_ColorWipe(0x00, 0x00, 0x00);
//	delay_ms(1500);

//	setLED_ColorWipe(0xFF, 0x01, 0x02);
//	delay_ms(1);
//	setLED_ColorWipe(0x00, 0xFF, 0x00);
//	delay_ms(1500);
//	setLED_ColorWipe(0x00, 0x00, 0xFF);
//	delay_ms(1500);	
//	setLED_ColorWipe(0x00, 0xFF, 0x00);
//	delay_ms(1500);
//	setLED_ColorWipe(0xFF, 0x00, 0x00);
//	delay_ms(1500);
//	setLED_ColorWipe(0x00, 0xFF, 0x00);
//	delay_ms(1500);
//	setLED_ColorWipe(0x00, 0x00, 0xFF);
//	delay_ms(1500);		
//	setLED_ColorWipe(0x00, 0x00, 0x00);
//	delay_ms(1500);

//	setLED_ColorWipe(0xFF, 0xFF, 0xFF);
//	delay_ms(1500);

//	OP_WS2812C_Send_1bit(1);
//	delay_ms(1);
//	OP_WS2812C_Send_1bit(0);
//	delay_ms(1);


//	GPIO_WS2812C_DATA1();
//	delay_ms(1);
//	GPIO_WS2812C_DATA0();
//	delay_ms(1);	
//	GPIO_WS2812C_Send_1bit(0);
//	GPIO_WS2812C_Send_1bit(0);
//	GPIO_WS2812C_Send_1bit(0);
//	GPIO_WS2812C_Send_1bit(0);
//	GPIO_WS2812C_Send_1bit(0);	
//	delay_ms(1);
	
//	delay(1);
//	P00 = 0;
//	delay(1);
//	P00 = 1;

//	setLED_ColorWipe(0xFF, 0x00, 0x00);
//	delay_ms(1500);

//	getBreathing(30);
	
//	getRainbow(30);	//OK
//	getRainbowCycle(1 ,5);//OK
//	getTheaterChase(60,0x3F,0x3F,0x00);//OK
//	getTheaterChaseRainbow(1);//OK
//	getRGBSequence(3);//OK
//	getAlternateColors(50, 16, 0xFF, 0, 0, 0, 0, 0xFF);//OK
//	getFullEmpty(30, 0x3F, 0x3F, 0x3F);//OK
//	getPatternMove(30, 1, 0x3F, 0x3F, 0x00);//OK
//	getHeartBeat(1000, HEARTBEAT_STEPS*4, HEARTBEAT_STEPS*0, HEARTBEAT_STEPS*2);
//	getCircularRing(30, 0xFF, 0xFF, 0xFF);
//	getFromAToB(3, 4, 0x3F, 0, 0, 0xFF, 0, 0xFF);
//	getColorWheel(5);
//	getAllColors(1);
			
//	setLED_ColorWipe(0xFF, 0xFF, 0xFF);//test
//	SPI_Send_Data(0x01);

//	setLED_ColorWipe(0xFF,0xFF,0xFF);
//	delay_ms(300);	
//	setLED_ColorWipe(0x00,0x00,0x00);
//	delay_ms(300);	


	P13 = 1;
	setLED_ColorWipe(255,0,0);
	P13 = 0;

		
}

void StateMachine(void)
{

	if (DemoState++ >= state_Max)
	{
		DemoState = state_Default+1;
	}
//	DemoState = state_AllColors;	//quick test

	#if defined (ENABLE_UART0_LOG)
	printf("demo : 0x%X\r\n",DemoState);
	#endif

	switch(DemoState)
	{
		case state_Rainbow:
			getRainbow(50);
			delay_ms(48);
			break;

		case state_RainbowCycle:
			getRainbowCycle(2 ,10);	//(5 , 1000);
			break;

		case state_TheaterChase:
			getTheaterChase(30,colorsFull[Coloridx][0], colorsFull[Coloridx][1], colorsFull[Coloridx][2]);
//			getTheaterChase(60,0x00,0xFF,0x00);
//			getTheaterChase(60,0x00,0x00,0xFF);
//			delay_ms(120);

			ColorIndexChange();
		
			break;

		case state_TheaterChaseRainbow:
			getTheaterChaseRainbow(1);
			delay_ms(240);
			break;

		case state_RGBSequence:
			getRGBSequence(60);
			break;
		
		case state_AlternateColors:
			getAlternateColors(128*500, 128, colorsFull[Coloridx][0], colorsFull[Coloridx][1], colorsFull[Coloridx][2], colorsFull[Coloridx][0], colorsFull[Coloridx][1], colorsFull[Coloridx][2]);

			ColorIndexChange();
			break;

		case state_FullEmpty:
			getFullEmpty(30, colorsFull[Coloridx][0], colorsFull[Coloridx][1], colorsFull[Coloridx][2]);

			ColorIndexChange();
			break;
		
		case state_PatternMove:
			getPatternMove(50, 10, colorsFull[Coloridx][0], colorsFull[Coloridx][1], colorsFull[Coloridx][2]);

			ColorIndexChange();
			break;

